package Exam;

public class Example02 {
	/*
	 * 클래스에서의 타입 변환
	 * 클래스의 객체 타입 변환
	 * 클래스의 타입 변환도 마찬가지로 자동 형변환과 강제 형변환이 있다.
	 * 클래스의 타입변환은 서로 상속관계에 있는 클래스에서만 사용가능
	 * 
	 * 클래스의 자동 타입변환
	 * 개발자가 직접 명시하지 않아도 자동으로 타입변환이 일어나는 것을 말함
	 * 클래스 자동 타입변환은 상속관계에 있는 자식클래스의 객체를 
	 * 부모 타입의 객체로 변환하는 것을 말한다.
	 * 
	 * 클래스의 강제 타입 변환
	 * 부모타입을 자식 타입으로 변환시킨다.
	 * 자바의 규약으로 부모 타입에서 자식클래스의 멤버에 접근 불가
	 * 자식 타입이 부모 타입으로 자동 변환하고 다시 자식 타입으로 
	 * 변환할 때 사용
	 * 자식타입에 선언된 필드와 메소들를 반드시 사용해야 한다면
	 * 강제타입 변환을 하여 자식타입을 다시 변환하고 
	 * 자식클래스의 기능을 사용가능하게 한다.
	 * 
	 * instanceof로 true/false로 가능/불가능 여부를 미리 확인할 수 있다.
	 */
}
